of-run/canal/canal2D/canal2DsRAS_owc1800w130_FFt-z10-flowRate/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS; //Reynolds-averaged simulation modelling

RAS
{
    RASModel        kEpsilon; //name of RAS turbulence model

    turbulence      on; //turn the solving of turbulence modelling

    printCoeffs     on;//print model coeffs to terminal at simulation start up
}


// ************************************************************************* //
